#!/usr/bin/env python3
# -*- coding:utf-8 -*- 

#
# _ooOoo_
# o8888888o
# 88" . "88
# (| -_- |)
#  O\ = /O
# ___/`---'\____
# .   ' \\| |// `.
# / \\||| : |||// \
# / _||||| -:- |||||- \
# | | \\\ - /// | |
# | \_| ''\---/'' | |
# \ .-\__ `-` ___/-. /
# ___`. .' /--.--\ `. . __
# ."" '< `.___\_<|>_/___.' >'"".
# | | : `- \`.;`\ _ /`;.`/ - ` : | |
# \ \ `-. \_ __\ /__ _/ .-` / /
# ======`-.____`-.___\_____/___.-`____.-'======
# `=---='
# .............................................
#           佛曰：bug泛滥，我已瘫痪！
#

'常用的集合'
__author__ = 'click'
__date__ = '2018/8/2 下午4:37'

from collections import namedtuple, deque

# namedtuple,用来自定义一个tuple,可以规定tuple的个数
# ,并且可以使用定义的属性代替索引进行取值

Circle = namedtuple('Circle', ['x', 'y', 'r'])
circle = Circle(1, 1, 4)
print('namedtuple横坐标(x)%1s 纵坐标(y)%2s 半径(r)%3s' % (circle.x, circle.y, circle.r))
# 提升 插入、删除效率的deque

q = deque(['1', 2, '3'])
print('deque%s'%q)